Tekla.Structures.ModelInternal.dotPolycurvePoint_t
Struct for the serialized polycurve point type.

Tekla.Structures.ModelInternal.dotPolycurvePoint_t.Point
Point on the polycurve

Tekla.Structures.ModelInternal.dotPolycurvePoint_t.Type
Type of the point. Must be in the range of Tekla.Structures.ModelInternal.PolycurveSerialization.SerializedPointType